In [1]:
import pandas as pd

In [3]:
data= pd.read_csv("Customer Purchasing Behaviors.csv")

In [4]:
data

,user_id,age,annual_income,purchase_amount,loyalty_score,region,purchase_frequency
0,1,25,45000,200,4.5,North,12
1,2,34,55000,350,7.0,South,18
2,3,45,65000,500,8.0,West,22
3,4,22,30000,150,3.0,East,10
4,5,29,47000,220,4.8,North,13
...,...,...,...,...,...,...,...
233,234,40,60000,450,7.2,West,20
234,235,38,59000,430,6.9,North,20
235,236,54,74000,630,9.4,South,27
236,237,32,52000,360,5.8,West,18
237,238,31,51000,340,5.6,North,17

In [5]:
data.head(1)

,user_id,age,annual_income,purchase_amount,loyalty_score,region,purchase_frequency
0,1,25,45000,200,4.5,North,12

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 238 entries, 0 to 237
Data columns (total 7 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   user_id             238 non-null    int64
 1   age                 238 non-null    int64
 2   annual_income       238 non-null    int64
 3   purchase_amount     238 non-null    int64
 4   loyalty_score       238 non-null    float64
 5   region              238 non-null    object
 6   purchase_frequency  238 non-null    int64
dtypes: float64(1), int64(5), object(1)
memory usage: 13.1+ KB

In [7]:
data.isna().sum()

user_id               0
age                   0
annual_income         0
purchase_amount       0
loyalty_score         0
region                0
purchase_frequency    0
dtype: int64

In [8]:
data.isnull().sum()

user_id               0
age                   0
annual_income         0
purchase_amount       0
loyalty_score         0
region                0
purchase_frequency    0
dtype: int64

In [9]:
data.columns

Index(['user_id', 'age', 'annual_income', 'purchase_amount', 'loyalty_score',
       'region', 'purchase_frequency'],
      dtype='object')

In [12]:
data= data.rename(columns= {
    'user_id':'User ID',
    'age': 'Age',
    'region': 'Region',
    'annual_income': 'Annual Income', 
    'purchase_amount': 'Purchase Amount', 
    'loyalty_score': 'Loyalty Score',
    'purchase_frequency': 'Purchase Frequency'
})

In [13]:
data.columns

Index(['User ID', 'Age', 'Annual Income', 'Purchase Amount', 'Loyalty Score',
       'Region', 'Purchase Frequency'],
      dtype='object')

In [14]:
data.head(1)

,User ID,Age,Annual Income,Purchase Amount,Loyalty Score,Region,Purchase Frequency
0,1,25,45000,200,4.5,North,12

In [15]:
data['Purchase Frequency']

0      12
1      18
2      22
3      10
4      13
       ..
233    20
234    20
235    27
236    18
237    17
Name: Purchase Frequency, Length: 238, dtype: int64

In [18]:
data= data.rename(columns= {
    'Purchase Frequency': 'Number of Purchases'
})

In [19]:
data.columns

Index(['User ID', 'Age', 'Annual Income', 'Purchase Amount', 'Loyalty Score',
       'Region', 'Number of Purchases'],
      dtype='object')

In [20]:
data.head(1)

,User ID,Age,Annual Income,Purchase Amount,Loyalty Score,Region,Number of Purchases
0,1,25,45000,200,4.5,North,12

In [21]:
data.to_csv("cleaned_customer_purchase_behavior.csv", index= False)